const ImageData = [
  {
    id: "G1",
    title: "스타트업 사무실이 홍수에 잠겼어요",
    images: [
      { src: "/Giver1.jpg", alt: "image1" },
      { src: "/Giver1-1.jpg", alt: "image2" },
      { src: "/Giver1-2.jpg", alt: "image3" },
    ],
    textBox: "처음 사무실에 들어설 때의 설렘과 기대가 아직도 생생한데, 이곳이 물에 잠겨 다른 모습으로 변해버린 것이 마음 아프기 짝이 없습니다. 저희 사무실은 지역 사회와 산업 생태계에도 중요한 역할을 하고 있습니다. 하지만 이번 홍수로 인해 저희의 업무와 미래가 불투명해지고, 더 큰 손실을 입을 수도 있다는 생각에 불안함이 큽니다. 그러나 저희는 단단한 결심을 가지고 이 어려운 시기를 극복하고자 합니다. 기부금을 통해 저희는 사무실의 복구와 인프라 복구에 힘쓸 것입니다. 물론 이로 인한 손실 보상도 고려하고 있습니다. 그리고 무엇보다도 향후 재난 대비를 위한 대응 기금을 마련하여 비슷한 상황이 다시 발생할 때 더 빠르게 대처할 수 있도록 할 것입니다. 저희는 이를 통해 다시 한번 출발하여 더 나은 미래를 향해 걸어갈 수 있기를 희망합니다. 마지막으로, 여러분의 따뜻한 마음에 진심으로 감사드립니다. 여러분의 기부금은 우리에게 큰 힘이 되고, 이 어려운 시기를 함께 극복할 수 있게 해줄 것입니다. 저희가 이 어려운 상황을 극복하고 더 나아가는 모습을 여러분들께 보여드릴 수 있도록 최선을 다하겠습니다."
  },
  {
    id: "G2",
    title: "부모님이 교통사고를 당하셨어요",
    images: [
      { src: "/Giver2.jpg", alt: "image5" },
      { src: "/Giver2-1.jpg", alt: "image6" },
      { src: "/Giver2-2.jpeg", alt: "image7" },
    ],
    textBox: "가장 사랑하는 분들인 부모님이 교통사고를 당하셨다는 소식은 저에게 큰 충격과 슬픔을 안겨주었습니다. 하지만 동시에 그분들이 치료를 받으시며 건강을 회복하고 계시는 것에 무한한 감사함을 느낍니다. 제게도 부모님이라는 소중한 존재가 있기 때문에 그분들이 건강하게 평상시처럼 행복한 일상을 보낼 수 있다는 사실이 얼마나 큰 기쁨인지를 이해합니다. 지금까지 많은 분들이 기부와 격려의 말씀으로 저희 가족을 도와주셨습니다. 그 어떤 말로도 표현하기 어려운 감사함을 느낍니다. 저희 부모님의 빠른 회복과 이런 어려운 시기를 함께 극복해나가기 위해 끝까지 힘을 내겠습니다. 기부해주신 모든 분들께 깊은 감사를 전합니다. 여러분의 따뜻한 마음이 저희 가족에게 큰 힘이 되고 있습니다. 부모님의 빠른 쾌유와 평상시의 삶으로 돌아가는 것이 제게 가장 큰 소망입니다. 앞으로도 제가 그분들께 보답할 수 있도록 최선을 다하고, 부모님의 희망과 꿈을 이루는데 기여하고 싶습니다. 한 번 더 감사의 말씀을 드리며, 여러분들의 따뜻한 마음이 저희 가족에게 빛과 힘이 되고 있음을 잊지 않겠습니다. 감사합니다."
  },
  {
    id: "G3",
    title: "유기견들을 보호해주세요",
    images: [
      { src: "/Giver3.jpg", alt: "image9" },
      { src: "/Giver3-1.png", alt: "image10" },
      { src: "/Giver3-2.jpg", alt: "image11" },
    ],
    textBox: "저희는 얼마 전, 안락사로 유기된 무지개 다리 아래 미소를 띄우며 새로운 가족을 찾던 유기견을 입양하여 행복한 가정으로 데려왔습니다. 이 자리를 빌어 진심으로 감사의 말씀을 드리고자 합니다. 입양 이후로, 유기견은 우리 가족에게 큰 행복과 감사함을 선사해주고 있습니다. 저희와 함께 보내는 시간은 즐겁고 따뜻하며, 그의 애정 어린 눈빛과 충실한 애착으로 저희를 위로하고 기쁨을 선사합니다. 이제 그는 진정한 가족의 일원으로서 사랑과 관심을 나누며 새로운 삶을 시작할 수 있습니다.이 모든 것이 가능한 것은 바로 여러분들의 기부와 지지 덕분입니다. 여러분들의 따뜻한 마음이 유기견의 삶을 바꾸어주었으며, 이제 저희는 그에게 행복과 안락한 생활을 제공할 수 있습니다. 입양 이후의 유기견의 변화를 보면서, 기부금으로 이뤄낸 이 특별한 일에 대한 감사함이 점점 더 깊어지고 있습니다. 마지막으로, 기부에 참여해주신 모든 분들께 진심으로 감사드립니다. 여러분의 사랑과 지지로 우리 가족은 새로운 희망과 미래를 향해 함께 걷고 있습니다. 이런 특별한 순간들을 기억하며, 저희는 더 많은 이들에게 행복을 선사"
  },
  {
    id: "G4",
    title: "가장이 되어버린 초등학생 OO군",
    images: [
      { src: "/Giver4.jpg", alt: "image13" },
      { src: "/Giver4-1.jpg", alt: "image14" },
      { src: "/Giver4-2.jpg", alt: "image15" },
      { src: "/Giver4-3.jpeg", alt: "image16" },
    ],
    textBox: "부모님이 없는 저희는 할머니와 여동생과 함께 어려움을 겪고 있었습니다. 그러나 이런 어려운 시기에도 저희를 따뜻하게 포옹해주시고 사랑해주시는 할머니의 무한한 사랑에 힘을 얻어 나아갈 수 있었습니다. 할머니께서는 늘 저희를 위해 희생을 아끼지 않으시고, 어려운 상황에서도 용기와 힘을 보여주시며 함께 이겨내고자 하시는 모습이 저에게 큰 격려와 용기를 주었습니다. 그리고 이제는, 여러분들의 따뜻한 마음도 저희 가족에게 큰 힘이 되었습니다. 여러분들의 기부금은 저희에게 큰 도움이 되었으며, 이런 어려운 시기를 훨씬 더 쉽게 극복할 수 있도록 해주었습니다. 여러분들의 지지와 사랑을 느끼면서, 저희는 힘든 상황에서도 희망을 잃지 않고 앞으로 나아갈 수 있음을 깨달았습니다. 저희는 부모님이 없어도, 서로를 사랑하고 지지하며 힘든 일을 이겨내고자 노력하고 있습니다. 이런 어려운 상황에서도 저희에게 따뜻한 손길을 보내주시고, 도움을 주시는 여러분들께 진심으로 감사드립니다. 여러분들의 작은 선행이 저희에게는 큰 의미를 갖고 있습니다. 마지막으로, 이 감사의 글을 통해 여러분들께 진심으로 감사의 인사"
  },
  {
    id: "G5",
    title: "결손 아이들이 홀로 설 수 있도록",
    images: [
      { src: "/Giver5.jpeg", alt: "image17" },
      { src: "/Giver5-1.jpg", alt: "image18" },
      { src: "/Giver5-2.jpg", alt: "image19" },
      { src: "/Giver5-3.jpg", alt: "image20" },
    ],
    textBox: "여러분들의 사랑은 저희에게 큰 용기와 희망을 주었습니다. 더 이상 무엇에 굴복하지 않고, 앞으로 나아갈 수 있도록 도와주셔서 감사합니다. 저희는 어떤 어려움에 처하더라도 늘 희망을 잃지 않고 노력하고 있습니다. 여러분들의 따뜻한 손길이 우리를 더 강하게 만들고, 더 많은 꿈과 희망을 키울 수 있게 해주었습니다. 이런 어려운 상황에서도 저희에게 희망을 안겨주시고, 더 나은 미래를 꿈꿀 수 있도록 도와주신 여러분들께 진심으로 감사드립니다. 여러분들의 기부금은 저희에게 큰 도움이 되었으며, 우리를 더욱 강하게 만들어 주었습니다. 무엇보다도, 여러분들의 따뜻한 마음과 관심이 저희에게 큰 위안이 되고, 더 나아갈 힘을 주었습니다. 이제 저희는 더 많은 사랑과 배려를 나누며 미래를 향해 함께 나아갈 수 있습니다. 마지막으로, 이 감사의 글을 통해 여러분들께 진심으로 감사의 인사를 전하고자 합니다. 여러분들의 따뜻한 마음이 결손가정의 아이들에게 큰 힘이 되고, 이 어려운 시기를 함께 극복할 수 있도록 도와주고 있음을 잊지 않겠습니다. 여러분들의 선행에 보답할 수 있도록 더욱 노력하겠습니다."
  },
  {
    id: "G6",
    title: "할머니께서 코로나에 걸리셨어요",
    images: [
      { src: "/Giver6.PNG", alt: "image21" },
      { src: "/Giver6-1.jpg", alt: "image22" },
      { src: "/Giver6-2.jpeg", alt: "image23" },
    ],
    textBox: "저희 가족은 이 힘든 시기에 코로나로 인해 극심한 어려움을 겪었습니다. 특히, 저희 소중한 할머니가 감염되어 상태가 심각해지자 저희는 큰 불안과 걱정 속에서 지내고 있었습니다. 하지만 여러분들의 따뜻한 마음과 기부금 덕분에 저희 할머니는 빠른 시일 내에 완치하셨습니다. 이 특별한 순간을 함께 나누고자 이 감사글을 쓰게 되었습니다. 코로나로 인한 위기 속에서 저희 가족은 절망의 늪에 빠질 뻔했습니다. 그러나 여러분들의 사랑과 지지로 인해 우리는 더 이상 외로움과 힘들음을 견뎌내지 않아도 된다는 희망의 빛을 찾게 되었습니다. 여러분들의 따뜻한 마음과 기부금 덕분에, 할머니는 전문적인 치료와 관심을 받으면서 빠른 속도로 건강을 회복하셨습니다. 이런 큰 기쁨을 저희 가족 모두가 함께 나누고 있습니다. 여러분들의 기부금은 우리 가족에게 큰 축복이 되었습니다. 저희 할머니는 여러분들의 따뜻한 마음과 사랑을 느끼면서, 더욱 강하게 건강해지고, 긍정적인 에너지를 얻어내고 있습니다. 무엇보다도, 우리는 여러분들께서 함께 해주신다는 사실에 감사함을 느끼고 있습니다. 코로나로 인한 이 힘든 시기에도 저희 가족"
  },
];

export default ImageData;
