import Waiting0 from "../assets/WaitingImage/Waiting0.jpeg";
import Waiting1 from "../assets/WaitingImage/Waiting1.jpeg";
import Waiting2 from "../assets/WaitingImage/Waiting2.jpeg";
import Waiting3 from "../assets/WaitingImage/Waiting3.jpeg";
import Waiting4 from "../assets/WaitingImage/Waiting4.jpeg";
import Waiting5 from "../assets/WaitingImage/Waiting5.jpeg";
import Waiting8 from "../assets/WaitingImage/Waiting8.jpg";
import Waiting9 from "../assets/WaitingImage/Waiting9.png";

export const user={
  id: "Account1",
  totalTokens: "100,000"
}

export const contents = [
  {
    title: "홍수로 집을 잃은 사람들",
    organization: "강서구청",
    image: Waiting2,
    progress: 89,
    barWidth: "220px",
    totalTokens: "10,947,000",
    targetTokens: "12,300,000",
    categories: ["all", "disaster"],
    text: `홍수 피해자들을 돕기 위한 모금 캠페인이 시작되었습니다. 홍수로 인해 가정과 재산을 잃은 피해자들은 지금도 어려움을 겪고 있습니다. 하지만 그들은 불평하지 않고, 힘든 상황에서도 힘으로 이겨내려고 노력하고 있습니다.
지금, 우리의 작은 후원이라도 그들에게는 큰 힘이 될 수 있습니다. 피해자들에게는 따뜻한 도움의 손길이 되어주실 분들을 기다리고 있습니다. 그들의 삶을 다시 일으킬 수 있도록 우리의 작은 힘을 모아주세요.
후원금은 피해자들에게 음식, 생활용품, 그리고 의료 서비스를 제공하는 데 사용됩니다. 또한 재건을 돕기 위해 사용되어, 그들의 미래를 밝고 희망찬 것으로 만들 수 있습니다.
지금, 지역사회의 연대와 사랑으로 하나되어 피해자들에게 도움을 주세요. 작은 기부라도 큰 변화를 이끌 수 있습니다. 그들의 희망을 함께 응원하고 싶다면, 지금 바로 후원해주세요.
피해자들의 미래가 밝을 수 있도록, 지금 당신의 따뜻한 마음을 보여주세요. 함께하는 여러분의 손길이 그들에게 큰 힘이 될 것입니다.`,
    manager: "김동국",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "얼른 기부가 시작돼야할 거 같아서 투표했습니다!",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "홍수 때문에 많은 사람이 피해입는 거 같아 마음아프네요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "하루빨리 복구됐으면 좋겠네요~",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "얼른 기부가 시작됐으면 좋겠네요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "하루빨리 기부가 시작됐으면 좋겠습니다",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "홍수 피해가 크지 않았으면 합니다",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
    ],
  },
  {
    title: "폭우로 인해 집과 가족을 잃은 이들",
    organization: "서울시사회복지센터",
    image: Waiting0,
    progress: 83,
    barWidth: "210px",
    totalTokens: "10,209,000",
    targetTokens: "12,300,000",
    categories: ["all", "disaster"],
    text: `폭우로 인한 피해로 많은 이웃들이 아픔과 상실을 겪고 있습니다. 이런 어려운 시기에 우리는 서로에게 더 많은 사랑과 지지가 필요합니다. 우리는 이웃의 고통을 함께 나누고, 손길을 건네며, 희망과 따뜻함을 전해주어야 합니다. 지금 우리 지역에서는 많은 가정들이 물에 잠기고, 소중한 가족들을 잃었습니다. 일부 이웃들은 완전히 모든 것을 잃고 처음부터 살아가야 합니다. 이런 상황에서 우리는 절실하게 도움을 필요로 합니다. 우리는 기부를 통해 이러한 피해를 입은 이웃들에게 지지의 손길을 전해야 합니다. 기부는 그들이 식량과 비상용품을 받을 수 있게 해주고, 재건을 위한 희망을 제공해줍니다. 기부는 어려운 시기를 극복하고 삶을 재창출하는 데에 큰 영향을 끼칩니다. 기부를 통해 우리는 고통 속에서 희망을 발견할 수 있습니다. 어둠 속에서 빛을 찾을 수 있도록, 모두가 손을 잡고 서로에게 힘을 실어주어야 합니다. 작은 기부도 큰 변화를 이끌어낼 수 있습니다. 그래서, 저희는 여러분의 기부에 동참하고자 합니다. 우리 지역의 이웃들이 힘들고 어려운 상황에서 더 나은 미래를 만들어 나갈 수 있도록 돕고자 합니다. 기부는 서울시사회복지센터에서 안전하게 진행되며, 모든 기부금은 피해를 입은 이웃들을 위해 전액 사용됩니다. 여러분의 따뜻한 마음과 희망의 손길이 이웃들에게 큰 힘이 됩니다. 우리는 모두가 더 나은 세상을 만들기 위해 함께 나아갈 수 있습니다. 미래를 위해 손을 잡아주세요.`,
    manager: "지만석",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "폭우로 너무 많은 사람들이 피해를 입어서 마음 아프네요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "기부가 시급해보여 투표했습니다",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "하루빨리 피해복구가 됐으면 좋겠습니다~",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "큰 피해가 없었으면합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
    ],
  },
  {
    title: "사랑하는 안내견 바울이",
    organization: "동물사랑가족협회",
    image: Waiting9,
    progress: 60,
    barWidth: "160px",
    totalTokens: "7,850,000",
    targetTokens: "12,300,000",
    categories: ["all", "animal"],
    text: `안내견 바울이는 온종일 주인과 함께 돌아다니며 사람들을 도와주는 특별한 강아지였습니다. 그의 영리한 눈빛과 사랑스러운 미소로 사람들의 마음을 사로잡았습니다.
    그러나 어느 날, 바울이는 갑작스러운 불안과 아픔을 느꼈습니다. 주인은 걱정스러워 바울이를 수의사에게 데려갔습니다. 수의사는 바울이의 건강을 살펴보고 심장병이라는 심각한 진단을 내렸습니다.
    바울이의 심장은 힘겨워하며 싸우고 있었습니다. 주인은 충격에 휩싸이며 바울이의 치료를 위해 최선을 다하기로 결심했습니다. 그러나 심장병 치료를 위해 많은 돈과 시간이 필요했습니다.
    주인과 바울이는 이제 서로를 위해 힘들게 어울리며, 심장병과의 싸움을 위한 힘든 시간을 보내야 했습니다. 바울이는 주인의 눈빛을 보며, 마음 속으로 주인에게 힘이 되고자 노력했습니다.
    치료는 어려웠지만 주인은 포기하지 않았습니다. 그러나 여전히 어려움이 남아있었습니다. 바울이는 점점 더 힘들어져가고, 주인은 자신의 한계를 깨닫게 되었습니다. 
    바울이는 우리의 도움과 사랑을 받으며, 심장병과의 싸움에서 희망의 빛을 되찾을 수 있을 것입니다. 
    지금, 우리 바울이를 위해 도와주세요. 감사합니다.`,
    manager: "노희진",
    comments: [
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "바울이가 주인이랑 다시 걸었으면 좋겠어요ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "바울아 아프지마ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "바울이가 수술을 이겨냈으면 좋겠네요",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "바울이 수술하기까지 어떻게 기다려요ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "하루빨리 기부가 시작됐으면 좋겠네요",
      },
      {
        userId: "익명",
        date: "2023.07.30",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.30",
        comment: "응원합니다!!",
      },
      
    ],
  },
  {
    title: "영양실조로 굶어가는 아이들",
    organization: "세이브 더 칠드런",
    image: Waiting1,
    progress: 52,
    barWidth: "142px",
    totalTokens: "6,396,000",
    targetTokens: "12,300,000",
    categories: ["all", "weak"],
    text: `지금, 우리가 함께 걸어가는 이 특별한 여정은 아프리카 아이들을 위한 희망의 선물을 전하는 일입니다. 이 세상이 가지고 있는 어려움과 어둠 속에서도 빛나고 있는 그들의 미소와 소망에 우리는 더 많은 주목과 떨림을 느끼고 있습니다. 이제 우리가 이들에게 따뜻한 마음과 관심을 보내는 순간입니다. 아프리카 지역의 어린이들은 가난과 교육의 어려움으로 인해 무엇보다도 우리의 도움을 필요로 합니다. 그들의 삶은 우리가 상상조차 할 수 없을 정도로 어렵고 힘든 상황에서 흘러가고 있습니다. 그러나 우리의 연대와 손길을 통해 이들 아이들에게 더 나은 미래를 꿈꾸게 해줄 수 있습니다. 우리는 세이브더칠드런을 통해 아프리카 어린이들을 위한 새로운 희망의 문을 엽니다. 우리는 이들의 곁에 서서, 우리의 노력과 기부를 통해 그들에게 변화를 선사하고자 합니다. 우리는 교육의 기회와 의료 서비스, 그리고 먹을 거리와 깨끗한 물을 제공하여 이들의 미래를 빛나게 하고자 합니다. 우리가 함께하는 순간에, 이들 어린이들은 우리의 따뜻한 마음의 선물을 받을 수 있습니다. 우리의 손길로 그들에게 더 나은 세상을 전할 수 있으며, 그들의 삶에 밝은 미래의 씨앗을 심을 수 있습니다.세계 어디에 있든지 이들 아이들을 위해 우리는 손을 잡아야 합니다. 우리가 보내는 작은 기부가 더 큰 사랑의 표식이 될 수 있습니다. 그들의 삶에 변화를 가져다 주는 순간에, 우리의 마음은 더욱 따뜻함으로 가득 차게 될 것입니다. 감사합니다. 여러분의 아름다운 마음과 따뜻한 선행에 감사드리며, 이 아름다운 여정을 함께 걸어가길 기대합니다.`,
    manager: "박성진", 
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "아이들이 아프지않게 자랐으면 좋겠네요",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "먹는건 잘 먹고 자라렴",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "기부명단에 올랐으면 좋겠어요~",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "아프리카에 많은 지원이 필요하네요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
    ],
  },
  {
    title: "지영이, 혼자가 아니야!",
    organization: "굿네이버스",
    image: Waiting3,
    progress: 42,
    barWidth: "120px",
    totalTokens: "5,166,000",
    targetTokens: "12,300,000",
    categories: ["all", "weak"],
    text: `지영이는 한 부모 가정에서 동생을 돌보면서 혼자 지내고 있어요. 어린 나이에도 불구하고 엄청난 책임감으로 동생을 보살피며
    자라나고 있어요. 하지만 어려운 환경과 경제적 어려움으로 인해 많은 어려움을 겪고 있어요. 그런데 지영이는 불평하지 않아요. 오히려 어려운 상황에서도 밝은 미소를 지어내며 살아가고 있어요. 그런 지영이를 보면 마음이 따뜻해지고, 더 많은 사람들이 그녀를
    도와주고 싶어지는 거예요. 우리의 작은 후원이라도 지영이에게는 큰 힘이 될 거예요. 그녀의 꿈을 이룰 수 있도록 함께 도와주세요. 지금 지영이와 함께한 기부로 행복을 나누어주세요. 그녀의 미래를 밝고 희망찬 것으로 만들어주기 위해 지금 바로 기부해주세요! 당신의
    작은 선물이 지영이에게는 큰 응원이 될 거예요. 지영이가 더 나은 미래를 만들 수 있도록 우리의 손길을 건네주세요. 함께하는 여러분의 따뜻한 마음이 그녀에게 힘이 될 거예요. 지금 당신의 손을 내밀어 지영이와 함께 희망의 문을 열어주세요! 지영이는 훌륭한 아이에요. 
    그녀의 잠재력을 발견하고 응원하는 것은 우리 모두에게 큰 보람이 될 거예요. 그녀의 꿈과 희망을 응원하고 지원하기 위해 지금 바로 행동해주세요. 지영이를 돕기 위해 우리 모두의 손길을
    모아주세요! 감사합니다. 지영이와 함께하는 따뜻한 마음을 전달해주셔서요. 지영이가 더 나은 미래를 만들 수 있도록 우리의 성원을 보내주세요. 함께해주셔서 감사합니다!`,
    manager: "김윤성",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "지영이가 오히려 잘 버텨줘서 고맙네요ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "한창 사랑받을 나이에 일찍 철들어버린건 아닐까요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "우리 아이가 생각나네요 투표합니다!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "지영이가 씩씩하게 잘 자라주었으면 좋겠어요~",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
    ],
  },
  {
    title: "강원 산불 피해 모금",
    organization: "한국재난관리협회",
    image: Waiting4,
    progress: 35,
    barWidth: "90px",
    totalTokens: "4,350,000",
    targetTokens: "12,300,000",
    categories: ["all", "disaster", "environment"],
    text: `한 여름, 아름다운 강원 지역은 즐거운 웃음과 기쁨으로 넘쳐납니다. 그러나 어느 날, 강원 산림에서 갑작스러운 산불이 발생하면서 이 행복한 시간은 순식간에 어두운 그림자로 뒤덮혔습니다. 맹렬한 불길은 소방관들도 앞세워 막을 수 없이 퍼져갔습니다.
    주민들은 가족, 자산, 그리고 추억들을 불길 속에 잃어가고 있었습니다. 그런 가운데 한 소녀가 있었습니다. 이름은 지은이라고 합니다.
    지은이는 작은 나이에도 불구하고 늘 밝고 따뜻한 마음을 가진 아이였습니다. 어린 친구들과 함께 즐겁게 뛰놀던 그녀는 갑자기 불길이 휘몰아쳐 집안이 불타 버렸음을 깨달았습니다. 지은이의 가족은 불길 속에서 탈출하지 못하고 말았습니다.
    이제 지은이는 외로운 삶을 힘겨워하며 그 누구에게도 말하지 않는 슬픔을 안고 살아가야 합니다. 행복했던 그 시절을 지은이에게 다시 만들어주세요. 여러분의 작은 손길이 지은이에게 큰 도움이 됩니다.`,
    manager: "김대웅",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "인근 주민들한테 큰 피해가 없었으면 좋겠어요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "지은이한테 너무 아픈 기억이 될 거 같네요ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "투표했습니다",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "산에서 담배피우는 사람들을 처벌해야합니다!!",
      },
      {
        userId: "익명",
        date: "2023.07.31",
        comment: "응원합니다!!",
      },
    ],
  },
    {
    title: "집과 가족을 빼앗은 지진",
    organization: "한국재난관리협회",
    image: Waiting8,
    progress: 35,
    barWidth: "90px",
    totalTokens: "4,350,000",
    targetTokens: "12,300,000",
    categories: ["all", "disaster", "environment"],
    text: `주인공 서준은 고단한 일상 속에서도 밝은 미소를 지으며 살아가고 있었습니다. 그러나 어느 날, 지진이 찾아와 그의 일상은 지독한 혼란 속으로 무너져 내렸습니다.
    지진의 흔적이 남아있는 도시는 많은 피해를 입었습니다. 서준은 지진으로 인해 집과 부모님을 잃었습니다. 혼자 남겨져 고독과 불안 속에서 서로를 지키려 애썼습니다.
    하루하루가 서준에게 힘든 시간들로 가득했습니다. 가족과 함께했던 따뜻한 추억들은 더 이상 손에 잡히지 않았습니다. 서준은 아무도 모르는 채로 힘겨운 상태에서 노력했습니다.
    그러나 지진으로 인한 상처와 아픔은 아직도 많이 남아있었습니다. 서준은 혼자서 이 모든 고통을 이겨내기 힘들었습니다.지진으로 인한 고통은 크지만, 우리가 함께하면 희망의 빛을 찾을 수 있습니다. 
    우리의 작은 도움이 모여 서준과 그의 이웃들의 미래에 밝은 희망을 비춰줄 수 있습니다. 지금, 서준과 그의 이웃들을 위해 도와주세요. 감사합니다.`,
    manager: "고기철",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "어린아이들한테 왜 이런 나쁜 일만 생기는지 너무 마음 아프네요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "하루빨리 기부가 시작됐으면 좋겠어요",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "투표했습니다!",
      },
      {
        userId: "익명",
        date: "2023.08.01",
        comment: "응원합니다!!",
      },
    ],
  },
  {
    title: "소아암 환자들을 위한 의료비 지원",
    organization: "사랑의열매",
    image: Waiting5,
    progress: 21,
    barWidth: "63px",
    totalTokens: "2,583,000",
    targetTokens: "12,300,000",
    categories: ["all", "weak", "medical"],
    text: `한 소년의 눈빛이 무엇을 담고 있을까요? 미소 준혁이, 이 소년은 소아암으로 고뇌하고 있었습니다. 어린 나이에 암의 비극을 마주하며 준혁이는 힘들지만 강한 아이로 성장했습니다.
    준혁이의 눈 속에는 통증과 고독, 그리고 희망의 빛이 함께 어우러져 있습니다. 가족과 함께한 추억들은 암의 압박 속에서도 준혁이를 지탱하고 있었습니다.
    그리고 준혁이의 이야기가 퍼져나가며, 우리는 다른 소아암 환자들의 아픔을 마주하게 됩니다. 어린이들은 미래에 꿈꾸기도 전에 불과한 나이에 무력함을 느끼고 있습니다.
    하지만 이 아이들은 결코 희망을 잃지 않았습니다. 가족과 친구들의 응원, 그리고 끊이지 않는 의료진들의 노력으로, 그들은 암과 싸우기로 결심했습니다.
    암과 싸우는 이 아이들을 위해 기부해주세요. 우리의 작은 성금들이 아이들에게 큰 응원이 될 것입니다. 더 많은 어린이들이 힘든 시련을 이겨내고 희망찬 미래를 꿈꿀 수 있도록 함께해주세요.`,
    manager: "박재성",
    comments: [
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "준혁이가 잘 버텨줬으면 좋겠어요ㅠㅠ",
      },
      {
        userId: "익명",
        date: "2023.08.02",
        comment: "아이가 무슨 잘못이 있다고 아이고...",
      },
    ],
  },
  // 다른 컨텐츠들도 추가...
];

export const List = [
  {
    userId: "공소연",
    date: "2023.7.30",
    howMany: "236,159",
  },
  {
    userId: "박지형",
    date: "2023.7.29",
    howMany: "410,000",
  },
  {
    userId: "밥먹는 제이지",
    date: "2023.7.29",
    howMany: "348,000",
  },
  {
    userId: "2PlusOne",
    date: "2023.7.28",
    howMany: "1,230,000",
  },
  {
    userId: "정민희",
    date: "2023.7.26",
    howMany: "30,000",
  },
  {
    userId: "비공개",
    date: "2023.7.24",
    howMany: "480,000",
  },
  {
    userId: "박새로이",
    date: "2023.7.24",
    howMany: "300,000",
  },
];
